module.exports.inbox = {
    modulename:'ticket',
    //admin
    name:'📬 صندوق پیام ها', 
    back:'🔙 بازگشت به صندوق پیام ها',
    readSym: ['📪','📭'],
    inboxDeleteAll: 'حذف تمام پیام ها',
    settings : '⚙️' + ' - ' + 'تنظیمات',
    backsetting: '🔙 بازگشت به ' + '⚙️' + ' - ' + 'تنظیمات',

    //user
    lable:'📨 تماس با ما',
    getmess :'لطفا پیغام خود را ارسال کنید.',

    query : {
        inbox : 'inbox',
        answer : 'ans',
        delete: 'delete'
    },

    mess : {
      answer : 'لطفا متن پاسخ را ارسال کنید، در پایان متن ارسال شده از طرف کاربر به پاسخ پیوست می شود.'  
    }
}