module.exports = {
    //public -----------------------------------------------------
    seccess         :'انجام شد',
    back            :'بازگشت به 🔙',
    escapEdit       :'⤴️ خارج شدن از ویرایش',
    chooseOtherText :'لطفا واژه دیگری انتخاب کنید.',
    choosethisItems :'لطفا از گزینه های زیر استفاده کنید.',
    newname         :'لطفا یک نام جدید انتخاب کنید',
    registeradmin   :'ثبت نام انجام شد، کابر مورد نظر باید از ابتدا ربات را استارت کند.',
    youareadmin     :'اکنون شما مدیر هستید.',
    endAttach       :'اتمام آپلود پیوست',
    getattachment   :'لطفا فایل های پیوست خود را ارسال کنید.',
    activation: {enable:'فعال کردن', disable:'غیر فعال کردن'},

    //user -------------------------------------------------------
    mainMenu        : 'صفحه اصلی',
    mainMenuMess    : 'خوش آمدید',
    backToMenu      :'بازگشت به منو اصلی 🔙',
    //send ticket
    contactWadminMess:'لطفا پیام متنی خود را برای مدیر مجموعه ارسال کنید.',

    //admin Setting module ------------------------------------------------------
    goToAdmin:{name:'🏁 بخش مدیریت', back:'🔙 بازگشت به مدیریت'},

    //symbles
    Published:'✅',
    NotPublished:'🚫',

    //query --------------------------------------------------------
    query:{
        publication:'public',
        upload     :'upld',
        attach     :'atch',
        removeAttachment:'ratch',
        delete          :'dlte',
        delete          :'publication',
        queryOrder      :'order',
    },

    //msc
    editOrder       :'اولویت',
    editOrderMess   :'لطفا اولویت دکمه را دکمه های این افزونه را با یک عدد صحیح مشخص کنید.' + '\n' + 'مثال: 1',
    editCategory    : 'لطفا منو مورد نظر را انتخاب کنید.',

}