module.exports.settings = {
    modulename:'settings',
    name : '⚙️ ' + 'تنظیمات',
    back : '🔙 بازگشت به تنظیمات',

    btns : {
        firstmess       :'پیغام ابتدایی',
        domain          :'آدرس دامنه',

        strToSticker     : 'استیکر بجای متن',
        strToSticker_back:'🔙 بازگشت به استیکر بجای متن',
        addsticker       :'افزودن استیکر',

        rowColumns      : 'سطر و ستون',
        rowColumns_back :'🔙 بازگشت به سطر و ستون',
        addMenu         :'افزودن منو',
    },

    mess : {
        firstmess : 'لطفا متن پیام ابتدایی ربات را ارسال کنید.',
        shorttext : 'لطفا یک متن طولانی تر ارسال کنید.',
        getdomain : 'لطفا آدرس دامنه وبسایتی که به ربات متصل است را ارسال کنید. برای اطلاعات بیشتر از شخص پشتیبان ربات سوال بپرسید.',
        getstickerName:'لطفا نام دکمه ای که میخواهید در پاسخ به آن استیکر ارسال شود را وارد کنید.' + '\nبه ابتدای نام یک - اضافه کنید. مثال "-فروشگاه"',
        getSticker:'لطفا استیکر مورد نظر خود را ارسال کنید.',
        
        getCategoryName: 'لطفا نام منویی که میخواهید سطر و ستور اختصاصی برای آن طراحی کنید ارسال کنید.' + '\nبه ابتدای نام یک - اضافه کنید. مثال "-فروشگاه"',
        getRow: 'لطفا سطر موردنظر را طبق ساختار زیر ارسال کنید.' + '\nformat: [row]-[total columns]\nsample: 2-3\n.' ,
    },

    query: {
        settings:'settings',
        admin:'a',
        strSticker:'ssticker',
        sticker:'stk',
        delete:'dlt',

        rowColumns: 'rc',
        addRow: 'arow',
        deleteRow: 'drow',
    },

    sections: {
        upload :'upload',
    }
}