module.exports.settings = {
    modulename:'settings',
    name : '⚙️ ' + 'تنظیمات',
    back : '🔙 بازگشت به تنظیمات',

    btns : {
        firstmess       :'پیغام ابتدایی',
        domain          :'آدرس دامنه',
        strToSticker    : 'استیکر بجای متن',
        strToSticker_back:'🔙 بازگشت به استیکر بجای متن',
        addsticker      :'افزودن استیکر',
    },

    mess : {
        firstmess : 'لطفا متن پیام ابتدایی ربات را ارسال کنید.',
        shorttext : 'لطفا یک متن طولانی تر ارسال کنید.',
        getdomain : 'لطفا آدرس دامنه وبسایتی که به ربات متصل است را ارسال کنید. برای اطلاعات بیشتر از شخص پشتیبان ربات سوال بپرسید.',
        getstickerName:'لطفا نام دکمه ای که میخواهید در پاسخ به آن استیکر ارسال شود را وارد کنید.',
        getSticker:'لطفا استیکر مورد نظر خود را ارسال کنید.'
    },

    query: {
        settings:'sets',
        admin:'a',
        strSticker:'ssticker',
        sticker:'stk',
        delete:'dlt',
    },

    sections: {
        upload :'upload',
    }
}